<?php

//==========    Тест функции EXPLODE       ======================
/*
$names = 'Alex-Nick-Lans';
var_dump($names); //Выведет переменную names, которая содержит строку с именами

$a = explode('-' , $names,);// Функция explode преобразует эту строку в массив. Первый параметр это разделитель, а его значение это тот знак в исходной строке, которым нам надо разделить ее на элементы. Вторым параметром добавляем строку в качестве и третий параметр это limit, т.е. максимальное количество элементов, которое будет содеражать наш массив. Если этот параметр отрицательный , то он "отрезает" с конца

var_dump($a);  # Выведет массив, полученный из строки
*/


//===============Тест функции IMPLODE===========================
/*
$names = ['Peter', 'Alex', 'Nick'];
var_dump($names);
$nowString = implode('-', $names);
var_dump($nowString);
*/


//===================Тест функции STR_REPLACE==============

